app/controllers/invoice_controller.rb

INSERT INTO "invoices" ("user_id", "number", "date", "company", "payer", "value", "emails", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"
---
  def create
    if !invoice_params_create[:number].present? || !invoice_params_create[:date].present? ||
      !invoice_params_create[:company].present? || !invoice_params_create[:payer].present? ||
      !invoice_params_create[:value].present? || !invoice_params_create[:emails].present?
      msg =  "Parâmetros inválidos!"
      return_response(url_redirect: "/invoice/list/", msg: msg, status: :unprocessable_entity)
      return
    end

    invoice_service = InvoiceService.new

    @invoice = invoice_service.new_invoice(params: invoice_params_create)
    @invoice.user_id = session[:current_user_id]

    if @invoice.save

SELECT "invoices".* FROM "invoices" WHERE "invoices"."id" = $1 LIMIT $2  [["id", 4268], ["LIMIT", 1]]
UPDATE "invoices" SET "date" = $1, "company" = $2, "payer" = $3, "value" = $4, "emails" = $5, "updated_at" = $6 WHERE "invoices"."id" = $7  [["date", "2022-05-10 00:00:00"], ["company", "cp"], ["payer", "p"], ["value", 15.0], ["emails", "xx"], ["updated_at", "2022-02-18 14:50:10.554933"], ["id", 4271]]
---
  def update
    if !invoice_params_update[:id].present? ||
      !invoice_params_update[:number].present? || !invoice_params_update[:date].present? ||
      !invoice_params_update[:company].present? || !invoice_params_update[:payer].present? ||
      !invoice_params_update[:value].present? || !invoice_params_update[:emails].present?
      msg =  "Parâmetros inválidos!"
      return_response(url_redirect: "/invoice/list/", msg: msg, status: :unprocessable_entity)
      return
    end

    @invoice = Invoice.find_by(id: invoice_params_update[:id])
    if !@invoice.present?
      respond_to do |format|
        msg =  "Parâmetros inválidos!"
        format.html { redirect_to("/invoice/list/", status: :unprocessable_entity) }
        format.json { render json: { notice: msg }, status: :unprocessable_entity }
      end
      return
    else

      if @invoice.update(invoice_params_update)

SELECT "invoices".* FROM "invoices" WHERE "invoices"."id" = $1 LIMIT $2  [["id", 0], ["LIMIT", 1]]
DELETE FROM "invoices" WHERE "invoices"."id" = $1  [["id", 4283]]
---
  def delete
    if !params[:id].present?
      respond_to do |format|
        msg =  "Parâmetros inválidos!"
        format.html { redirect_to("/invoice/list/", notice: msg, status: :unprocessable_entity) }
        format.json { render json: { notice: msg }, status: :unprocessable_entity }
      end
      return
    end
    @invoice = Invoice.find_by(id: invoice_params_update[:id])
    if !@invoice.present?
      respond_to do |format|
        msg =  "Parâmetros inválidos!"
        format.html { redirect_to("/invoice/list/", notice: msg, status: :unprocessable_entity) }
        format.json { render json: { notice: msg }, status: :unprocessable_entity }
      end
      return
    else
      if @invoice.destroy