app/controllers/user_controller.rb

SELECT "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "emai12@email.com"], ["LIMIT", 1]]
SELECT 1 AS one FROM "users" WHERE LOWER("users"."email") = LOWER($1) AND "users"."id" != $2 LIMIT $3  [["email", "email1@email.com"], ["id", 3241], ["LIMIT", 1]]
---
  def token

    #receive email by param
    email = params[:email]
    if !email.present?
      #return error
      return_response(url_redirect: root_path+"?error_id=1", msg: "E-mail not present", status: :unprocessable_entity)
      return
    end

    #new object service to user
    user_service = UserService.new

    #verify existence of email in database
    user = user_service.find_user_by_email(email: email)

    if !user.present?

SELECT 1 AS one FROM "users" WHERE LOWER("users"."email") = LOWER($1) AND "users"."id" != $2 LIMIT $3  [["email", "email1@email.com"], ["id", 3244], ["LIMIT", 1]]
---
  def activate

    #recieve email and token by params
    email = params[:email]
    token = params[:token]

    if !email || !token
      # params invalids
      msg =  "Params invalids!"
      return_response(url_redirect: root_path, msg: msg, status: :unprocessable_entity)
      return
    end

    #new object service to user
    user_service = UserService.new


    #verify if exists email in database
    user = user_service.find_user_by_email_and_token(email: email, value: token)

    if !user.present?